# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
# brew 'ack'
# brew 'bash'
brew 'awscli'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas'
brew 'pkg-config'
brew 'ssh-copy-id'
brew 'svn'
brew 'the_silver_searcher'
brew 'trash'
brew 'tree'
brew 'zlib'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'php'
# brew 'php@7.3'
# brew 'redis'
brew 'composer'
brew 'php@7.4'
brew 'imagemagick'
brew 'yarn'

# Apps
# cask '1password'
# cask 'bartender'
# cask 'caffeine'
# cask 'dbngin'
# cask 'discord'
# cask 'firefox'
# cask 'github'
# cask 'google-chrome'
# cask 'gpg-suite'
# cask 'insomnia'
# cask 'iterm2'
# cask 'phpstorm'
# cask 'postman'
# cask 'ray'
# cask 'rocket'
# cask 'screenflow'
# cask 'signal'
# cask 'skype'
# cask 'slack'
# cask 'spectacle'
# cash 'spotify'
# cask 'steam'
# cask 'teamviewer'
# cask 'telegram-desktop'
# cask 'the-unarchiver'
# cask 'tinkerwell'
# cask 'tower'
# cask 'transmission'
# cask 'transmit'
# cask 'typora'
# cask 'whatsapp'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'docker'
cask 'figma'
cask 'google-backup-and-sync'
cask 'grammarly'
cask 'imageoptim'
cask 'sublime-text'
cask 'tableplus'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
cask 'font-lato'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# Mac App Store
# mas 'MindNode', id: 1289197285
mas 'Evernote', id: 406056744
mas 'Spark', id: 1176895641
mas 'Tweetbot', id: 1384080005
