# Taps
tap 'hashicorp/tap'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
#tap 'fwartner/tap'
tap 'nicoverbruggen/homebrew-cask'

# Brew
# brew 'ack'
# brew 'bash'
brew 'awscli'
brew 'composer'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'hashicorp/tap/packer'
brew 'httpie'
brew 'htop'
brew 'hub'
brew 'imagemagick'
#brew 'fwartner/tap/mac-cleanup'
brew 'mackup'
brew 'mas'
brew 'mingw-w64'
brew 'mysql'
brew 'nginx'
brew 'php'
brew 'php@8.1'
brew 'pkg-config'
brew 'redis'
brew 'ssh-copy-id'
brew 'svn'
brew 'the_silver_searcher'
brew 'trash'
brew 'tree'
brew 'wrk'
brew 'yarn'
brew 'zlib'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Casks

# Typically installed by AKQA IT
# cask 'google-chrome'
# cask 'slack'

# Unsure why these are disabled
# cask 'transmission'
# cask 'transmit'

cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-drive'  # https://formulae.brew.sh/cask/google-drive
cask 'grammarly'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'miro'          # https://formulae.brew.sh/cask/miro
cask 'notion'        # https://formulae.brew.sh/cask/notion
cask 'phpmon'        # https://github.com/nicoverbruggen/phpmon
cask 'pop'           # https://formulae.brew.sh/cask/pop
cask 'postman'
cask 'ray'           # https://formulae.brew.sh/cask/ray
cask 'readdle-spark' # https://formulae.brew.sh/cask/readdle-spark
cask 'rocket'
cask 'setapp'        # https://formulae.brew.sh/cask/setapp
cask 'signal'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'telegram-desktop'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'tower'
cask 'typora'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# Mac App Store
mas 'Brother iPrint&Scan', id: 1193539993
mas 'Dato', id: 1470584107
mas 'Evernote', id: 406056744
mas 'HP Easy Scan', id:967004861
# mas 'Spark', id: 1176895641
mas 'Tomato 2: Pomodoro Timer', id:1494210770
mas 'Tweetbot', id: 1384080005

# Installed via Setapp
#cask 'bartender'    # Bartender Alternative - https://matthewpalmer.net/vanilla/
#cask 'tableplus'
#mas 'Forecast Bar', id: 982710545
#mas 'MindNode', id: 1289197285
